#include <iostream>

#include <vector>

using namespace std;
//---------------------Функции и Прототипы---------------------------------------





//------------------------MAIN----------------------------------------------------
int main() {
	setlocale(LC_ALL, "RU");
	srand(time(NULL));
	//-------------------------------САМА ПРОГА-------------------------------------

	int m, n;      // m - строки  , n - столбцы , ( вектор: n - строки , k - стоблцы ( он один у вектора) )


	cout << "Введите колличество строк матрицы: ";
	cin >> m;

	cout << "Введите колличество столбцов матрицы: ";
	cin >> n;


	//---Создаем МАТРИЦУ ---------------------------------------------------
	int** matrix = new int* [m];

	for (int i = 0; i < m; i++)
	{
		matrix[i] = new int[n];
	}

	// -----заполняем МАТРИЦУ ----------------------------------------------
	cout << endl << "Введите элементы МАТИРЦЫ: " << endl;

	for (int i = 0; i < m; i++)
	{
		for (int j = 0; j < n; j++)
		{
			cout << "matrix[" << i << "][" << j << "] = ";
			cin >> matrix[i][j];
		}
	}

	//------Создаем ВЕКТОР ---------------------------------------------------
	int* vector = new int[n];

	//-----заполняем ВЕКТОР---------------------------------------------------
	cout << endl << "Введите элементы ВЕКТОРА: " << endl;

	for (int i = 0; i < n; i++)
	{
		cout << "vector[" << i << "] = ";
		cin >> vector[i];
	}

	//--------Выводим МАТРИЦУ ------------------------------------------------
	cout << endl << "Введенная МАТРИЦА: " << endl;

	for (int i = 0; i < m; i++)
	{
		for (int j = 0; j < n; j++)
		{
			cout << matrix[i][j] << " ";
		}
		cout << endl;
	}

	//-------Выводим ВЕКТОР------------------------------------------------------
	cout << endl << "Введенный ВЕКТОР: " << endl;

	for (int i = 0; i < n; i++)
	{
		cout << vector[i] << endl;
	}

	//-------создаем РЕЗУЛЬИРУЮЩИЙ ВЕКТОР ----------------------------------------
	int* result = new int[m];

	//-------заполняем РЕЗУЛЬТИРУЮЩИЙ ВЕТОР --------------------------------------
	for (int i = 0; i < m; i++)
	{
		result[i] = 0;
		for (int j = 0; j < n; j++)
		{
			result[i] += matrix[i][j] * vector[j];
        }
	}

	//-------Выводим РЕЗУЛЬТИРУЮЩИЙ ВЕКТОР ---------------------------------------
	cout << endl << "Результирующий вектор: " << endl;
	
	for (int i = 0; i < m; i++)
	{
		cout << result[i] << endl;
	}

	//-------Ищем МАКСИМАЛЬНЫЙ элемент -------------------------------------------
	int max = result[0];

	for (int i = 1; i < m; i++)
	{
		if (max < result[i])
		{
			max = result[i];
		}
	}

	//--------Выводим МАКСИМАЛЬНЫЙ элемент ---------------------------------------

	cout << endl << "Максимальный элемент:  " << max << endl << endl;

	//-----Удаляем МАТРИЦУ , ВЕКТОР , РЕЗУЛЬТИРУЮЩИЙ ВЕКТОР -----------------------
	for (int i = 0; i < m; i++)
	{
		delete[] matrix[i];
	}

	delete[]matrix;
	delete[]vector;
	delete[]result;

	system("pause");

	return 0;
}
